In [1]:
from sqlalchemy import MetaData, Table, create_engine, select, and_, or_, not_, text
from sqlalchemy.sql import func, distinct, exists
import pandas as pd

In [2]:
engine = create_engine('sqlite:///../Data/Students.db')
metadata_obj = MetaData() # Объект-контейнер, содержит информацию о схеме данных
metadata_obj.reflect(bind=engine) # Отображение БД

In [3]:
exam_marks=Table("exam_marks", metadata_obj, autoload=True, autoload_with="engine")
lecturer=Table("lecturer", metadata_obj, autoload=True, autoload_with="engine")
student=Table("student", metadata_obj, autoload=True, autoload_with="engine")
subj_lect=Table("subj_lect", metadata_obj, autoload=True, autoload_with="engine")
subject=Table("subject", metadata_obj, autoload=True, autoload_with="engine")
university=Table("university", metadata_obj, autolad=True, autolad_with="engine")

st = student.alias()
em = exam_marks.alias()
su = subject.alias()
un = university.alias()
le = lecturer.alias()
sl = subj_lect.alias()

In [4]:
conn=engine.connect() # Соединение

<img src=../Img/pencil.png style="width:190px;height:190px">
<p style="background-color:powderblue; font-size:125%; color: rebeccapurple;">Выполните задания</p>
<p>Выполните задания с помощью соедиинения таблиц в Jupyter Notebook </p>

1. Напишите запрос, который выполняет вывод фамилий студентов, сдававших экзамены, вместе с идентификаторами каждого сданного ими предмета обучения.

2. Напишите запрос, который выполняет выборку фамилий всех студентов, с указанием для студентов, сдававших экзамены, идентификаторов сданных ими предметов обучения.

3. Напишите запрос, который выполняет вывод фамилий студентов, сдававших экзамены, вместе с наименованиями каждого сданного ими предмета обучения.

4. Напишите запрос на выдачу списка всех студентов. Для студентов, сдававших экзамены, укажите названия соответствующих предметов обучения.

5. Напишите запрос на выдачу названий всех предметов, по которым студенты получили только хорошие (4 и 5) оценки. В выходных данных должны быть приведены фамилии студентов, названия предметов и оценка.

6. Напишите запрос, который выполняет вывод списка университетов с рейтингом, превышающим 300, вместе со значением максимального размера стипендии, получаемой студентами в этих университетах.

7. Напишите запрос на выдачу списка студентов (в алфавитном порядке фамилий) вместе со значением рейтинга университета, где каждый из них учится, включив в список и тех студентов, место учебы которых в базе данных не указано.

8. Напишите запрос для получения списка всех студентов вместе с названиями университетов, в которых они учатся. Отдельным запросом получите записи, расширяющие данный список по сравнению с тем, который был бы получен внутренним соединением.

9. Напишите запрос для получения списка всех университетов вместе с фамилиями студентов, в них обучающихся. Отдельным запросом получите записи, расширяющие данный список по сравнению с тем, который был бы получен внутренним соединением.

10. Напишите запрос для получения списка всех университетов вместе с фамилиями преподавателей, в них работающих. Отдельным запросом получите записи, расширяющие данный список по сравнению с тем, который был бы получен внутренним соединением.

11. Напишите запрос для получения списка всех преподавателей вместе с университетами, в которых они работают. Есть ли отличие списка от того, который был бы получен внутренним соединением? Подтвердите отдельным запросом ваш вывод.

12. Напишите запрос для получения списка всех студентов и оценок, полученных ими на экзаменах. Отдельным запросом получите записи, расширяющие данный список по сравнению с тем, который был бы получен внутренним соединением.

13. Напишите запрос для получения списка всех экзаменационных оценок вместе с фамилиями получивших их студентов. Есть ли отличие списка от того, который был бы получен внутренним соединением? Подтвердите отдельным запросом ваш вывод.

14. Напишите запрос для получения полного списка предметов с соответствующими экзаменационными оценками. Есть ли отличие списка от того, который был бы получен внутренним соединением? Подтвердите отдельным запросом ваш вывод.

15. Напишите запрос для получения полного списка оценок вместе с названиями предметов, по которым они получены. Есть ли отличие списка от того, который был бы получен внутренним соединением? Подтвердите отдельным запросом ваш вывод.

# Решение

In [34]:
# 1. Напишите запрос, который выполняет вывод фамилий студентов, сдававших экзамены, вместе с идентификаторами каждого сданного ими предмета обучения.

s = select(student.c.surname, exam_marks.c.subj_id).join(exam_marks, student.c.student_id == exam_marks.c.student_id).where(exam_marks.c.mark > 2)

print(s)
pd.read_sql(s, conn)

SELECT student.surname, exam_marks.subj_id
FROM student JOIN exam_marks ON student.student_id = exam_marks.student_id
WHERE exam_marks.mark > :mark_1

       surname  subj_id
0     Казакова       73
1          Жук       73
2      Кондрат       10
3      Лазарев       56
4      Блохина       22
5      Жданова       56
6     Семенова       94
7   Мельникова       10
8     Борисова       94
9     Васильев       73
10     Петрова       43
11     Антонов       10
12     Костина       22
13    Васильев       13
14    Кузнецов       12
15      Лапина       56
16       Котов       10
17     Сидоров       22
18      Белкин       10
19       Лукин       11
20         Пак       11
21         Пак       94
22         Пак       73
23  Мельникова       14
24  Мельникова       56
25     Зайцева       10

In [35]:
# 2. Напишите запрос, который выполняет выборку фамилий всех студентов, с указанием для студентов, сдававших экзамены, идентификаторов сданных ими предметов обучения.

s = select(student.c.surname, exam_marks.c.subj_id).join(exam_marks, isouter=True)

print(s)
pd.read_sql(s, conn)

SELECT student.surname, exam_marks.subj_id
FROM student LEFT OUTER JOIN exam_marks ON student.student_id = exam_marks.student_id

     surname  subj_id
0     Иванов     43.0
1     Петров      NaN
2    Сидоров     22.0
3   Кузнецов     12.0
4    Зайцева     10.0
..       ...      ...
95   Киселев      NaN
96  Миронова      NaN
97    Павлов      NaN
98    Петров      NaN
99     Лукин     11.0

[100 rows x 2 columns]

In [36]:
# 3. Напишите запрос, который выполняет вывод фамилий студентов, сдававших экзамены, вместе с наименованиями каждого сданного ими предмета обучения.

s = select(student.c.surname, subject.c.subj_name).join(exam_marks, exam_marks.c.student_id == student.c.student_id).join(subject, subject.c.subj_id == exam_marks.c.subj_id).where(exam_marks.c.mark > 2).order_by(student.c.surname)

print(s)
pd.read_sql(s, conn)

SELECT student.surname, subject.subj_name
FROM student JOIN exam_marks ON exam_marks.student_id = student.student_id JOIN subject ON subject.subj_id = exam_marks.subj_id
WHERE exam_marks.mark > :mark_1 ORDER BY student.surname

       surname                                 subj_name
0      Антонов                               Информатика
1       Белкин                               Информатика
2      Блохина                                    Физика
3     Борисова                           Английский язык
4     Васильев                               Физкультура
5     Васильев                                       ОБЖ
6      Жданова                                   История
7          Жук                               Физкультура
8      Зайцева                               Информатика
9     Казакова                               Физкультура
10     Кондрат                               Информатика
11     Костина                                    Физика
12       Котов                               Информатика
13    Кузнецов                             Анализ данных
14     Лазарев                                   История
15      Лапина                                   История
16       Лукин   Программирование на языках Python и SQL
17  Мельникова                               Информатика
18  Мельникова  Обработка данных и моделирование в Excel
19  Мельникова                                   История
20         Пак   Программирование на языках Python и SQL
21         Пак                           Английский язык
22         Пак                               Физкультура
23     Петрова                                Математика
24    Семенова                           Английский язык
25     Сидоров                                    Физика

In [37]:
# 4. Напишите запрос на выдачу списка всех студентов. Для студентов, сдававших экзамены, укажите названия соответствующих предметов обучения.

s = select(student.c.surname, subject.c.subj_name).outerjoin(exam_marks, exam_marks.c.student_id == student.c.student_id).outerjoin(subject).order_by(student.c.surname)

print(s)
pd.read_sql(s, conn)

SELECT student.surname, subject.subj_name
FROM student LEFT OUTER JOIN exam_marks ON exam_marks.student_id = student.student_id LEFT OUTER JOIN subject ON subject.subj_id = exam_marks.subj_id ORDER BY student.surname

       surname      subj_name
0     Агафонов           None
1      Аксенов           None
2      Антонов    Информатика
3      Архипов           None
4   Афанасьева  Анализ данных
..         ...            ...
95     Федоров  Анализ данных
96     Фролова           None
97      Ширяев           None
98      Шубина           None
99        Юдин           None

[100 rows x 2 columns]

In [38]:
# 5. Напишите запрос на выдачу названий всех предметов, по которым студенты получили только хорошие (4 и 5) оценки. В выходных данных должны быть приведены фамилии студентов, названия предметов и оценка.

s = select(student.c.surname, subject.c.subj_name, exam_marks.c.mark).join(exam_marks, exam_marks.c.student_id == student.c.student_id).join(subject).where(exam_marks.c.mark >= 4)

print(s)
pd.read_sql(s, conn)

SELECT student.surname, subject.subj_name, exam_marks.mark
FROM student JOIN exam_marks ON exam_marks.student_id = student.student_id JOIN subject ON subject.subj_id = exam_marks.subj_id
WHERE exam_marks.mark >= :mark_1

       surname                                 subj_name  mark
0     Казакова                               Физкультура     4
1          Жук                               Физкультура     4
2      Лазарев                                   История     4
3      Блохина                                    Физика     5
4      Жданова                                   История     5
5     Семенова                           Английский язык     4
6   Мельникова                               Информатика     5
7     Борисова                           Английский язык     5
8      Костина                                    Физика     4
9     Васильев                                       ОБЖ     5
10    Кузнецов                             Анализ данных     5
11      Лапина                                   История     5
12       Котов                               Информатика     4
13     Сидоров                                    Физика     4
14      Белкин                               Информатика     5
15       Лукин   Программирование на языках Python и SQL     4
16         Пак   Программирование на языках Python и SQL     5
17         Пак                           Английский язык     4
18  Мельникова  Обработка данных и моделирование в Excel     4
19     Зайцева                               Информатика     5

In [39]:
# 6. Напишите запрос, который выполняет вывод списка университетов с рейтингом, превышающим 300, вместе со значением максимального размера стипендии, получаемой студентами в этих университетах.

s = select(university, func.max(student.c.stipend)).join(student, university.c.univ_id == student.c.univ_id).where(university.c.rating > 300).group_by(university.c.univ_id)

print(s)
pd.read_sql(s, conn)

SELECT university.univ_id, university.univ_name, university.rating, university.city, max(student.stipend) AS max_1
FROM university JOIN student ON university.univ_id = student.univ_id
WHERE university.rating > :rating_1 GROUP BY university.univ_id

   univ_id         univ_name  rating             city  max_1
0       11               НГУ     345      Новосибирск    250
1       14               БГУ     326         Белгород    250
2       15               ТГУ     368            Томск    250
3       18              ВГМА     327          Воронеж    200
4       22               МГУ     606           Москва    250
5       32               РГУ     416           Ростов    250
6       44              ФинУ     330           Москва    250
7       45  МГТУ им. Баумана     372           Москва    200
8       46   ФГБОУ "Политех"     304  Санкт-Петербург    200

In [40]:
# 7. Напишите запрос на выдачу списка студентов (в алфавитном порядке фамилий) вместе со значением рейтинга университета, где каждый из них учится, включив в список и тех студентов, место учебы которых в базе данных не указано.

s = select(student.c.surname, university.c.rating, university.c.univ_id).outerjoin(university).order_by(student.c.surname)

print(s)
pd.read_sql(s, conn)

SELECT student.surname, university.rating, university.univ_id
FROM student LEFT OUTER JOIN university ON university.univ_id = student.univ_id ORDER BY student.surname

       surname  rating  univ_id
0     Агафонов   296.0       10
1      Аксенов   296.0       10
2      Антонов   606.0       22
3      Архипов   606.0       22
4   Афанасьева   416.0       32
..         ...     ...      ...
85     Федоров   296.0       10
86     Фролова   330.0       44
87      Ширяев   304.0       46
88      Шубина   372.0       45
89        Юдин   327.0       18

[90 rows x 3 columns]

In [41]:
# 8. Напишите запрос для получения списка всех студентов вместе с названиями университетов, в которых они учатся. Отдельным запросом получите записи, расширяющие данный список по сравнению с тем, который был бы получен внутренним соединением.

s = select(st.c.surname, un.c.univ_name)
s = s.join(un, st.c.univ_id==un.c.univ_id)
s = s.order_by(st.c.surname)

print(s)
pd.read_sql(s, conn)

SELECT student_1.surname, university_1.univ_name
FROM student AS student_1 JOIN university AS university_1 ON student_1.univ_id = university_1.univ_id ORDER BY student_1.surname

       surname         univ_name
0     Агафонов               ВГУ
1      Аксенов               ВГУ
2      Антонов               МГУ
3      Архипов               МГУ
4   Афанасьева               РГУ
..         ...               ...
85     Федоров               ВГУ
86     Фролова              ФинУ
87      Ширяев   ФГБОУ "Политех"
88      Шубина  МГТУ им. Баумана
89        Юдин              ВГМА

[90 rows x 2 columns]

In [42]:
st2 = student.alias()
un2 = university.alias()

sq = select(st2.c.student_id)
sq = sq.join(un2, st.c.univ_id==un2.c.univ_id)
sq = sq.where(st2.c.student_id==st.c.student_id).exists()

s = select(st.c.surname, un.c.univ_name)
s = s.outerjoin(un, st.c.univ_id==un.c.univ_id)
s = s.where(~sq)
s = s.order_by(st.c.surname)

print(s)
pd.read_sql(s, conn)

SELECT student_1.surname, university_1.univ_name
FROM student AS student_1 LEFT OUTER JOIN university AS university_1 ON student_1.univ_id = university_1.univ_id
WHERE NOT (EXISTS (SELECT student_2.student_id
FROM student AS student_2, student AS student_1 JOIN university AS university_2 ON student_1.univ_id = university_2.univ_id
WHERE student_2.student_id = student_1.student_id)) ORDER BY student_1.surname

Empty DataFrame
Columns: [surname, univ_name]
Index: []

In [43]:
# 9. Напишите запрос для получения списка всех университетов вместе с фамилиями студентов, в них обучающихся. Отдельным запросом получите записи, расширяющие данный список по сравнению с тем, который был бы получен внутренним соединением.

s = select(st.c.surname, un.c.univ_name)
s = s.join_from(un, st, st.c.univ_id==un.c.univ_id)
s = s.order_by(st.c.surname)

print(s)
pd.read_sql(s, conn)

SELECT student_1.surname, university_1.univ_name
FROM university AS university_1 JOIN student AS student_1 ON student_1.univ_id = university_1.univ_id ORDER BY student_1.surname

       surname         univ_name
0     Агафонов               ВГУ
1      Аксенов               ВГУ
2      Антонов               МГУ
3      Архипов               МГУ
4   Афанасьева               РГУ
..         ...               ...
85     Федоров               ВГУ
86     Фролова              ФинУ
87      Ширяев   ФГБОУ "Политех"
88      Шубина  МГТУ им. Баумана
89        Юдин              ВГМА

[90 rows x 2 columns]

In [44]:
st2 = student.alias()
un2 = university.alias()

sq = select(un2.c.univ_id)
sq = sq.join_from(un2, st2)
sq = sq.where(un2.c.univ_id==un.c.univ_id).exists()

s = select(st.c.surname, un.c.univ_name)
s = s.outerjoin_from(un, st, st.c.univ_id==un.c.univ_id)
s = s.where(~sq)
s = s.order_by(st.c.surname)

print(s)
pd.read_sql(s, conn)

SELECT student_1.surname, university_1.univ_name
FROM university AS university_1 LEFT OUTER JOIN student AS student_1 ON student_1.univ_id = university_1.univ_id
WHERE NOT (EXISTS (SELECT university_2.univ_id
FROM university AS university_2 JOIN student AS student_2 ON university_2.univ_id = student_2.univ_id
WHERE university_2.univ_id = university_1.univ_id)) ORDER BY student_1.surname

  surname univ_name
0    None      МФТИ

In [45]:
# 10. Напишите запрос для получения списка всех университетов вместе с фамилиями преподавателей, в них работающих. Отдельным запросом получите записи, расширяющие данный список по сравнению с тем, который был бы получен внутренним соединением.

s = select(un.c.univ_name, le.c.surname + " " + le.c.name)
s = s.join_from(un, le, le.c.univ_id==un.c.univ_id)
s = s.order_by(un.c.univ_name)

print(s)
pd.read_sql(s, conn)

SELECT university_1.univ_name, lecturer_1.surname || :surname_1 || lecturer_1.name AS anon_1
FROM university AS university_1 JOIN lecturer AS lecturer_1 ON lecturer_1.univ_id = university_1.univ_id ORDER BY university_1.univ_name

           univ_name              anon_1
0               ВГМА    Богданова Оксана
1               ВГМА  Ситникова Светлана
2               ВГМА     Крюкова Людмила
3               ВГМА      Артемьева Майя
4               ВГМА     Сафонов Будимир
5                ВГУ        Зайцева Юлия
6                ВГУ    Максимова Иванна
7                ВГУ       Зыкова Оксана
8                ВГУ     Алексеев Елисей
9                ВГУ    Колесников Борис
10               ВГУ        Никонов Иван
11               ВГУ     Николаев Виктор
12               ВГУ      Сорокин Андрей
13               КФУ     Куликова Ираида
14               КФУ     Кудрявцева Анна
15  МГТУ им. Баумана       Волков Михаил
16               МГУ       Лагутин Павел
17               МГУ     Струков Николай
18               НГУ   Мамонтова Акулина
19               РГУ   Дорофеев Прокофий
20               РГУ     Беляков Мефодий
21               ТГУ     Тихонов Ладомир
22               ТГУ      Беспалов Юлиан
23              УЛГУ      Брагина Нинель
24              УЛГУ    Дмитриева Оксана
25              УЛГУ   Елисеев Виссарион
26   ФГБОУ "Политех"      Сафонова Лукия
27   ФГБОУ "Политех"     Стрелков Руслан
28   ФГБОУ "Политех"         Зимин Юлиан

In [46]:
st2 = student.alias()
un2 = university.alias()

sq = select(un2.c.univ_id)
sq = sq.join_from(un2, st2)
sq = sq.where(un2.c.univ_id==un.c.univ_id).exists()

s = select(st.c.surname, un.c.univ_name)
s = s.outerjoin_from(un, st, st.c.univ_id==un.c.univ_id)
s = s.where(~sq)
s = s.order_by(st.c.surname)

print(s)
pd.read_sql(s, conn)

SELECT student_1.surname, university_1.univ_name
FROM university AS university_1 LEFT OUTER JOIN student AS student_1 ON student_1.univ_id = university_1.univ_id
WHERE NOT (EXISTS (SELECT university_2.univ_id
FROM university AS university_2 JOIN student AS student_2 ON university_2.univ_id = student_2.univ_id
WHERE university_2.univ_id = university_1.univ_id)) ORDER BY student_1.surname

  surname univ_name
0    None      МФТИ

In [47]:
# 11. Напишите запрос для получения списка всех преподавателей вместе с университетами, в которых они работают. Есть ли отличие списка от того, который был бы получен внутренним соединением? Подтвердите отдельным запросом ваш вывод.


s = select((le.c.surname + " " + le.c.name).label('lecture name'), un.c.univ_name)
s = s.join_from(un, le, le.c.univ_id==un.c.univ_id)
s = s.order_by(un.c.univ_name)

print(s)
pd.read_sql(s, conn)

SELECT lecturer_1.surname || :surname_1 || lecturer_1.name AS "lecture name", university_1.univ_name
FROM university AS university_1 JOIN lecturer AS lecturer_1 ON lecturer_1.univ_id = university_1.univ_id ORDER BY university_1.univ_name

          lecture name         univ_name
0     Богданова Оксана              ВГМА
1   Ситникова Светлана              ВГМА
2      Крюкова Людмила              ВГМА
3       Артемьева Майя              ВГМА
4      Сафонов Будимир              ВГМА
5         Зайцева Юлия               ВГУ
6     Максимова Иванна               ВГУ
7        Зыкова Оксана               ВГУ
8      Алексеев Елисей               ВГУ
9     Колесников Борис               ВГУ
10        Никонов Иван               ВГУ
11     Николаев Виктор               ВГУ
12      Сорокин Андрей               ВГУ
13     Куликова Ираида               КФУ
14     Кудрявцева Анна               КФУ
15       Волков Михаил  МГТУ им. Баумана
16       Лагутин Павел               МГУ
17     Струков Николай               МГУ
18   Мамонтова Акулина               НГУ
19   Дорофеев Прокофий               РГУ
20     Беляков Мефодий               РГУ
21     Тихонов Ладомир               ТГУ
22      Беспалов Юлиан               ТГУ
23      Брагина Нинель              УЛГУ
24    Дмитриева Оксана              УЛГУ
25   Елисеев Виссарион              УЛГУ
26      Сафонова Лукия   ФГБОУ "Политех"
27     Стрелков Руслан   ФГБОУ "Политех"
28         Зимин Юлиан   ФГБОУ "Политех"

In [48]:
un2 = university.alias()
le2 = lecturer.alias()

sq = select(un2.c.univ_id)
sq = sq.join_from(un2, le2, le2.c.univ_id==un2.c.univ_id)
sq = sq.where(un2.c.univ_id==un.c.univ_id).exists()

s = select((le.c.surname+ " " + le.c.name).label('lecture name'), un.c.univ_name )
s = s.outerjoin_from(le, un, le.c.univ_id==un.c.univ_id)
s = s.where(~sq)

print(s)
pd.read_sql(s, conn)

SELECT lecturer_1.surname || :surname_1 || lecturer_1.name AS "lecture name", university_1.univ_name
FROM lecturer AS lecturer_1 LEFT OUTER JOIN university AS university_1 ON lecturer_1.univ_id = university_1.univ_id
WHERE NOT (EXISTS (SELECT university_2.univ_id
FROM university AS university_2 JOIN lecturer AS lecturer_2 ON lecturer_2.univ_id = university_2.univ_id
WHERE university_2.univ_id = university_1.univ_id))

Empty DataFrame
Columns: [lecture name, univ_name]
Index: []

In [49]:
# 12. Напишите запрос для получения списка всех студентов и оценок, полученных ими на экзаменах. Отдельным запросом получите записи, расширяющие данный список по сравнению с тем, который был бы получен внутренним соединением.

s = select((st.c.surname + " " + st.c.name).label('student name'), em.c.mark)
s = s.join_from(st, em, st.c.student_id==em.c.student_id)
s = s.order_by(st.c.student_id)

print(s)
pd.read_sql(s, conn)

SELECT student_1.surname || :surname_1 || student_1.name AS "student name", exam_marks_1.mark
FROM student AS student_1 JOIN exam_marks AS exam_marks_1 ON student_1.student_id = exam_marks_1.student_id ORDER BY student_1.student_id

           student name  mark
0           Иванов Иван   1.0
1         Сидоров Вадим   4.0
2        Кузнецов Борис   5.0
3         Зайцева Ольга   2.0
4         Зайцева Ольга   5.0
5     Ордуханян Рафаэль   2.0
6           Котов Павел   4.0
7          Белкин Вадим   5.0
8          Белкин Вадим   NaN
9     Семенова Вероника   4.0
10            Пак Ирина   5.0
11            Пак Ирина   4.0
12            Пак Ирина   3.0
13           Жук Оксана   4.0
14       Сергеева Фёкла   1.0
15      Кондрат Синицин   3.0
16       Одинцова Лидия   1.0
17     Мельникова Дарья   2.0
18     Мельникова Дарья   2.0
19      Мишина Светлана   1.0
20  Афанасьева Анжелика   1.0
21      Лапина Элеонора   5.0
22       Сорокина Ирина   1.0
23       Казакова Мария   4.0
24       Казакова Мария   1.0
25        Жданова Ирина   5.0
26         Костина Кира   4.0
27       Блохина Ираида   5.0
28  Мельникова Светлана   5.0
29  Мельникова Светлана   4.0
30  Мельникова Светлана   3.0
31     Вишнякова Анжела   1.0
32      Борисова Марина   5.0
33   Калашников Евгений   2.0
34   Калашников Евгений   2.0
35   Трофимов Владислав   2.0
36     Антонов Анатолий   3.0
37   Суханов Константин   1.0
38    Федоров Гостомысл   1.0
39   Лазарев Константин   4.0
40        Веселов Тимур   2.0
41           Жуков Пров   1.0
42      Васильев Матвей   3.0
43      Васильев Матвей   5.0
44     Вячеслав Пахомов   2.0
45    Петрова Екатерина   3.0
46          Лукин Артем   4.0

In [50]:
st2 = student.alias()
em2 = exam_marks.alias()

sq = select(st2.c.student_id)
sq = sq.join_from(st2, em2, st2.c.student_id==em2.c.student_id)
sq = sq.where(st2.c.student_id==st.c.student_id).exists()

s = select(st.c.student_id, (st.c.surname + " " + st.c.name).label('student name'), em.c.exam_id)
s = s.outerjoin_from(st, em, st.c.student_id==em.c.student_id)
s = s.where(~sq)
s = s.order_by(st.c.student_id)

print(s)
pd.read_sql(s, conn)

SELECT student_1.student_id, student_1.surname || :surname_1 || student_1.name AS "student name", exam_marks_1.exam_id
FROM student AS student_1 LEFT OUTER JOIN exam_marks AS exam_marks_1 ON student_1.student_id = exam_marks_1.student_id
WHERE NOT (EXISTS (SELECT student_2.student_id
FROM student AS student_2 JOIN exam_marks AS exam_marks_2 ON student_2.student_id = exam_marks_2.student_id
WHERE student_2.student_id = student_1.student_id)) ORDER BY student_1.student_id

    student_id          student name exam_id
0            3           Петров Петр    None
1           56         Дуб Елизавета    None
2           57        Кудряшова Вера    None
3           58        Журавлева Вера    None
4           60       Рожкова Пелагея    None
5           61           Соколова Ия    None
6           66    Некрасова Вероника    None
7           68        Казакова Ольга    None
8           69          Шубина Елена    None
9           70         Миронова Анна    None
10          72      Пономарева Алина    None
11          74       Гуляева Рукижат    None
12          75      Игнатова Зинаида    None
13          78      Агафонов Василий    None
14          80      Фролова Василиса    None
15          86          Жукова Фекла    None
16          89   Валерия Овчинникова    None
17          94      Васильева Оксана    None
18          95      Сорокина Валерия    None
19          96       Тимофеева Фаина    None
20         104       Бирюков Герасим    None
21         107        Морозов Кирилл    None
22         108         Назаров Икром    None
23         112         Захаров Софон    None
24         113       Аксенов Валерий    None
25         114         Панов Арсений    None
26         118    Кондратьев Николай    None
27         121     Воронова Антонина    None
28         124            Юдин Савва    None
29         125  Пономарев Варфоромей    None
30         130        Кудряшов Роман    None
31         131          Ковалев Ефим    None
32         133        Жуковский Юрий    None
33         135          Комаров Ипат    None
34         136           Ефимов Яков    None
35         137        Кулаков Феофан    None
36         139         Журавлев Фома    None
37         140         Ширяев Андрей    None
38         141        Ершов Митрофан    None
39         143        Бирюков Мартин    None
40         144     Ситников Викентий    None
41         146         Русаков Давид    None
42         147         Симонов Семен    None
43         148         Гуляев Кузьма    None
44         200     Баранов Александр    None
45         201        Архипов Андрей    None
46         202   Владимиров Анатолий    None
47         204          Петров Вадим    None
48         205         Иванова Мария    None
49         206      Киселев Владимир    None
50         207        Миронова Федор    None
51         265         Павлов Андрей    None
52         276          Петров Антон    None

In [51]:
# 13. Напишите запрос для получения списка всех экзаменационных оценок вместе с фамилиями получивших их студентов. Есть ли отличие списка от того, который был бы получен внутренним соединением? Подтвердите отдельным запросом ваш вывод.

s = select(em.c.exam_id, (st.c.surname + " " + st.c.name).label('student name'), em.c.mark, su.c.subj_name)
s = s.join_from(em, st, st.c.student_id==em.c.student_id)
s = s.join_from(em, su, em.c.subj_id==su.c.subj_id)
s = s.where(em.c.mark.is_not(None))

print(s)
pd.read_sql(s, conn)

SELECT exam_marks_1.exam_id, student_1.surname || :surname_1 || student_1.name AS "student name", exam_marks_1.mark, subject_1.subj_name
FROM exam_marks AS exam_marks_1 JOIN student AS student_1 ON student_1.student_id = exam_marks_1.student_id JOIN subject AS subject_1 ON exam_marks_1.subj_id = subject_1.subj_id
WHERE exam_marks_1.mark IS NOT NULL

,exam_id,student name,mark,subj_name
0,1,Вишнякова Анжела,1,Информатика
1,2,Казакова Мария,4,Физкультура
2,3,Жук Оксана,4,Физкультура
3,4,Жуков Пров,1,История
4,5,Кондрат Синицин,3,Информатика
5,6,Лазарев Константин,4,История
6,7,Афанасьева Анжелика,1,Анализ данных
7,8,Федоров Гостомысл,1,Анализ данных
8,9,Блохина Ираида,5,Физика
9,10,Суханов Константин,1,Физика
10,11,Мельникова Дарья,2,История
11,12,Жданова Ирина,5,История
12,13,Мельникова Дарья,2,Анализ данных
13,14,Казакова Мария,1,ОБЖ
14,15,Семенова Вероника,4,Английский язык
15,16,Мельникова Светлана,5,Информатика
16,17,Борисова Марина,5,Английский язык
17,18,Калашников Евгений,2,Английский язык
18,19,Васильев Матвей,3,Физкультура
19,20,Петрова Екатерина,3,Математика
20,21,Веселов Тимур,2,История
21,22,Антонов Анатолий,3,Информатика
22,23,Костина Кира,4,Физика
23,24,Калашников Евгений,2,ОБЖ
24,25,Мишина Светлана,1,Анализ данных
25,26,Сорокина Ирина,1,Физика
26,27,Васильев Матвей,5,ОБЖ
27,28,Кузнецов Борис,5,Анализ данных
28,29,Иванов Иван,1,Математика
29,30,Лапина Элеонора,5,История
30,31,Одинцова Лидия,1,Программирование на языках Python и SQL
31,32,Сергеева Фёкла,1,Физкультура
32,33,Трофимов Владислав,2,Физика
33,34,Котов Павел,4,Информатика
34,43,Сидоров Вадим,4,Физика
35,75,Белкин Вадим,5,Информатика
36,95,Вячеслав Пахомов,2,ОБЖ
37,100,Ордуханян Рафаэль,2,Информатика
38,101,Лукин Артем,4,Программирование на языках Python и SQL
39,102,Пак Ирина,5,Программирование на языках Python и SQL
40,103,Пак Ирина,4,Английский язык
41,104,Пак Ирина,3,Физкультура
42,105,Мельникова Светлана,4,Обработка данных и моделирование в Excel
43,106,Мельникова Светлана,3,История
44,145,Зайцева Ольга,2,Информатика
45,238,Зайцева Ольга,5,Информатика

In [52]:
st2 = student.alias()
em2 = exam_marks.alias()

sq = select(em2.c.exam_id)
sq = sq.join_from(em2, st2, st2.c.student_id==em2.c.student_id)
sq = sq.where(em2.c.exam_id==em.c.exam_id).exists()

s = select(em.c.exam_id, (st.c.surname + " " + st.c.name).label('student name'), em.c.mark, su.c.subj_name)
s = s.outerjoin_from(em, st, st.c.student_id==em.c.student_id)
s = s.join_from(em, su, em.c.subj_id==su.c.subj_id)
s = s.where(em.c.mark.is_not(None))
s = s.where(~sq)

print(s)
pd.read_sql(s, conn)

SELECT exam_marks_1.exam_id, student_1.surname || :surname_1 || student_1.name AS "student name", exam_marks_1.mark, subject_1.subj_name
FROM exam_marks AS exam_marks_1 LEFT OUTER JOIN student AS student_1 ON student_1.student_id = exam_marks_1.student_id JOIN subject AS subject_1 ON exam_marks_1.subj_id = subject_1.subj_id
WHERE exam_marks_1.mark IS NOT NULL AND NOT (EXISTS (SELECT exam_marks_2.exam_id
FROM exam_marks AS exam_marks_2 JOIN student AS student_2 ON student_2.student_id = exam_marks_2.student_id
WHERE exam_marks_2.exam_id = exam_marks_1.exam_id))

Empty DataFrame
Columns: [exam_id, student name, mark, subj_name]
Index: []

In [53]:
# 14. Напишите запрос для получения полного списка предметов с соответствующими экзаменационными оценками. Есть ли отличие списка от того, который был бы получен внутренним соединением? Подтвердите отдельным запросом ваш вывод.

s = select(su.c.subj_id, su.c.subj_name, em.c.exam_id, em.c.mark)
s = s.join_from(su, em, su.c.subj_id==em.c.subj_id)

print(s)
pd.read_sql(s, conn)

SELECT subject_1.subj_id, subject_1.subj_name, exam_marks_1.exam_id, exam_marks_1.mark
FROM subject AS subject_1 JOIN exam_marks AS exam_marks_1 ON subject_1.subj_id = exam_marks_1.subj_id

    subj_id                                 subj_name  exam_id  mark
0        10                               Информатика        1   1.0
1        73                               Физкультура        2   4.0
2        73                               Физкультура        3   4.0
3        56                                   История        4   1.0
4        10                               Информатика        5   3.0
5        56                                   История        6   4.0
6        12                             Анализ данных        7   1.0
7        12                             Анализ данных        8   1.0
8        22                                    Физика        9   5.0
9        22                                    Физика       10   1.0
10       56                                   История       11   2.0
11       56                                   История       12   5.0
12       12                             Анализ данных       13   2.0
13       13                                       ОБЖ       14   1.0
14       94                           Английский язык       15   4.0
15       10                               Информатика       16   5.0
16       94                           Английский язык       17   5.0
17       94                           Английский язык       18   2.0
18       73                               Физкультура       19   3.0
19       43                                Математика       20   3.0
20       56                                   История       21   2.0
21       10                               Информатика       22   3.0
22       22                                    Физика       23   4.0
23       13                                       ОБЖ       24   2.0
24       12                             Анализ данных       25   1.0
25       22                                    Физика       26   1.0
26       13                                       ОБЖ       27   5.0
27       12                             Анализ данных       28   5.0
28       43                                Математика       29   1.0
29       56                                   История       30   5.0
30       11   Программирование на языках Python и SQL       31   1.0
31       73                               Физкультура       32   1.0
32       22                                    Физика       33   2.0
33       10                               Информатика       34   4.0
34       22                                    Физика       43   4.0
35       10                               Информатика       75   5.0
36       13                                       ОБЖ       95   2.0
37       10                               Информатика      100   2.0
38       11   Программирование на языках Python и SQL      101   4.0
39       11   Программирование на языках Python и SQL      102   5.0
40       94                           Английский язык      103   4.0
41       73                               Физкультура      104   3.0
42       14  Обработка данных и моделирование в Excel      105   4.0
43       56                                   История      106   3.0
44       10                               Информатика      145   2.0
45       10                               Информатика      238   5.0
46       10                               Информатика      639   NaN

In [54]:
su2 = subject.alias()
em2 = exam_marks.alias()

sq = select(su2.c.subj_id)
sq = sq.join_from(su2, em2, su2.c.subj_id==em2.c.subj_id)
sq = sq.where(su2.c.subj_id==su.c.subj_id).exists()

s = select(su.c.subj_id, su.c.subj_name, em.c.exam_id, em.c.mark)
s = s.outerjoin_from(su, em, su.c.subj_id==em.c.subj_id)
s = s.where(~sq)

print(s)
pd.read_sql(s, conn)

SELECT subject_1.subj_id, subject_1.subj_name, exam_marks_1.exam_id, exam_marks_1.mark
FROM subject AS subject_1 LEFT OUTER JOIN exam_marks AS exam_marks_1 ON subject_1.subj_id = exam_marks_1.subj_id
WHERE NOT (EXISTS (SELECT subject_2.subj_id
FROM subject AS subject_2 JOIN exam_marks AS exam_marks_2 ON subject_2.subj_id = exam_marks_2.subj_id
WHERE subject_2.subj_id = subject_1.subj_id))

   subj_id                                        subj_name exam_id  mark
0       23  Теория вероятностей и математическая статистика    None  None
1       72                                      Физкультура    None  None

In [55]:
# 15. Напишите запрос для получения полного списка оценок вместе с названиями предметов, по которым они получены. Есть ли отличие списка от того, который был бы получен внутренним соединением? Подтвердите отдельным запросом ваш вывод.

s = select(em.c.exam_id, em.c.mark, su.c.subj_id, su.c.subj_name)
s = s.join_from(em, su, em.c.subj_id==su.c.subj_id)
s = s.where(em.c.mark.is_not(None))

print(s)
pd.read_sql(s, conn)

SELECT exam_marks_1.exam_id, exam_marks_1.mark, subject_1.subj_id, subject_1.subj_name
FROM exam_marks AS exam_marks_1 JOIN subject AS subject_1 ON exam_marks_1.subj_id = subject_1.subj_id
WHERE exam_marks_1.mark IS NOT NULL

    exam_id  mark  subj_id                                 subj_name
0         1     1       10                               Информатика
1         2     4       73                               Физкультура
2         3     4       73                               Физкультура
3         4     1       56                                   История
4         5     3       10                               Информатика
5         6     4       56                                   История
6         7     1       12                             Анализ данных
7         8     1       12                             Анализ данных
8         9     5       22                                    Физика
9        10     1       22                                    Физика
10       11     2       56                                   История
11       12     5       56                                   История
12       13     2       12                             Анализ данных
13       14     1       13                                       ОБЖ
14       15     4       94                           Английский язык
15       16     5       10                               Информатика
16       17     5       94                           Английский язык
17       18     2       94                           Английский язык
18       19     3       73                               Физкультура
19       20     3       43                                Математика
20       21     2       56                                   История
21       22     3       10                               Информатика
22       23     4       22                                    Физика
23       24     2       13                                       ОБЖ
24       25     1       12                             Анализ данных
25       26     1       22                                    Физика
26       27     5       13                                       ОБЖ
27       28     5       12                             Анализ данных
28       29     1       43                                Математика
29       30     5       56                                   История
30       31     1       11   Программирование на языках Python и SQL
31       32     1       73                               Физкультура
32       33     2       22                                    Физика
33       34     4       10                               Информатика
34       43     4       22                                    Физика
35       75     5       10                               Информатика
36       95     2       13                                       ОБЖ
37      100     2       10                               Информатика
38      101     4       11   Программирование на языках Python и SQL
39      102     5       11   Программирование на языках Python и SQL
40      103     4       94                           Английский язык
41      104     3       73                               Физкультура
42      105     4       14  Обработка данных и моделирование в Excel
43      106     3       56                                   История
44      145     2       10                               Информатика
45      238     5       10                               Информатика

In [56]:
su2 = subject.alias()
em2 = exam_marks.alias()

sq = select(em2.c.exam_id)
sq = sq.join_from(em2, su2, em2.c.subj_id==su2.c.subj_id)
sq = sq.where(em2.c.exam_id==em.c.exam_id).exists()

s = select(em.c.exam_id, em.c.mark, su.c.subj_id, su.c.subj_name)
s = s.outerjoin_from(em, su, em.c.subj_id==su.c.subj_id)
s = s.where(em.c.mark.is_not(None))
s = s.where(~sq)

print(s)
pd.read_sql(s, conn)

SELECT exam_marks_1.exam_id, exam_marks_1.mark, subject_1.subj_id, subject_1.subj_name
FROM exam_marks AS exam_marks_1 LEFT OUTER JOIN subject AS subject_1 ON exam_marks_1.subj_id = subject_1.subj_id
WHERE exam_marks_1.mark IS NOT NULL AND NOT (EXISTS (SELECT exam_marks_2.exam_id
FROM exam_marks AS exam_marks_2 JOIN subject AS subject_2 ON exam_marks_2.subj_id = subject_2.subj_id
WHERE exam_marks_2.exam_id = exam_marks_1.exam_id))

Empty DataFrame
Columns: [exam_id, mark, subj_id, subj_name]
Index: []